IDEA Open Model
OpenModel.GetMaxId Method (OpenElementId)
Compatible with IDEA StatiCa v 10.1
 Get max Id value for specified type
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public int GetMaxId(
	OpenElementId obj
)
Public Function GetMaxId (
	obj As OpenElementId
) As Integer
public:
int GetMaxId(
	OpenElementId^ obj
)
Parameters
obj
Type: IdeaRS.OpenModel.OpenElementId
Object
Return Value
Type: Int32
Max Id value or zero if don't any exists
See Also
Reference
OpenModel Class
GetMaxId Overload
IdeaRS.OpenModel Namespace